# Ex1 - Filtering and Sorting Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [3]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep = '\t')

In [4]:
chipo.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

### Step 4. How many products cost more than $10.00?

In [30]:
# item_price datatype is not interger 
# chipo.item_price.value_counts() # counts unique item prices and sum them
# item price dtype is not int, remove $, then convert it to float and asssign to a var

chipo['price_float'] = pd.to_numeric(chipo.item_price.str.slice(1))

In [31]:
chipo['price_float']

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: price_float, Length: 4622, dtype: float64

In [32]:
# chipo.item_price>10   item_price is still object type, we have to convert it to int
  
(chipo['price_float']>10).sum()   # returns total number of orders when items_price >10


# (chipo_price_float>10)    # returns true when item_price > 10

1130

In [33]:
chipo.head(5)

,order_id,quantity,item_name,choice_description,item_price,items_10dollar,price_float
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,False,2.39
1,1,1,Izze,[Clementine],$3.39,False,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,False,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,False,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,True,16.98

### Step 5. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [34]:
# need to determine price of each item

chipo['price_per_item'] = chipo.price_float/chipo.quantity

In [111]:
chipo[['price_per_item', 'item_name']]

      price_per_item                              item_name
0               2.39           Chips and Fresh Tomato Salsa
1               3.39                                   Izze
2               3.39                       Nantucket Nectar
3               2.39  Chips and Tomatillo-Green Chili Salsa
4               8.49                           Chicken Bowl
...              ...                                    ...
4617           11.75                          Steak Burrito
4618           11.75                          Steak Burrito
4619           11.25                     Chicken Salad Bowl
4620            8.75                     Chicken Salad Bowl
4621            8.75                     Chicken Salad Bowl

[4622 rows x 2 columns]

In [102]:
# find max price of each unique item

prod_price=chipo.groupby('item_name').agg({'price_float': 'max'})

In [104]:
prod_price.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 6 Pack Soft Drink to Veggie Soft Tacos
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price_float  50 non-null     float64
dtypes: float64(1)
memory usage: 800.0+ bytes

In [106]:
# number of unique prduct names thats more than $10

(prod_price.price_float>10).sum()

31

In [36]:
chipo.head(5)

,order_id,quantity,item_name,choice_description,item_price,items_10dollar,price_float,price_per_item
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,False,2.39,2.39
1,1,1,Izze,[Clementine],$3.39,False,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,False,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,False,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,True,16.98,8.49

In [39]:
# print a data frame with only two columns item_name and item_price

df=chipo[['item_name', 'item_price']]

In [40]:
df

                                  item_name item_price
0              Chips and Fresh Tomato Salsa     $2.39
1                                      Izze     $3.39
2                          Nantucket Nectar     $3.39
3     Chips and Tomatillo-Green Chili Salsa     $2.39
4                              Chicken Bowl    $16.98
...                                     ...        ...
4617                          Steak Burrito    $11.75
4618                          Steak Burrito    $11.75
4619                     Chicken Salad Bowl    $11.25
4620                     Chicken Salad Bowl     $8.75
4621                     Chicken Salad Bowl     $8.75

[4622 rows x 2 columns]

### Step 6. Sort by the name of the item

In [43]:
#sort_values is meant to sort by the values of columns

chipo.item_name.sort_values()

3389    6 Pack Soft Drink
341     6 Pack Soft Drink
1849    6 Pack Soft Drink
1860    6 Pack Soft Drink
2713    6 Pack Soft Drink
              ...
2384    Veggie Soft Tacos
781     Veggie Soft Tacos
2851    Veggie Soft Tacos
1699    Veggie Soft Tacos
1395    Veggie Soft Tacos
Name: item_name, Length: 4622, dtype: object

In [46]:
chipo.sort_values('item_name')

,order_id,quantity,item_name,choice_description,item_price,items_10dollar,price_float,price_per_item
3389,1360,2,6 Pack Soft Drink,[Diet Coke],$12.98,True,12.98,6.49
341,148,1,6 Pack Soft Drink,[Diet Coke],$6.49,False,6.49,6.49
1849,749,1,6 Pack Soft Drink,[Coke],$6.49,False,6.49,6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],$6.49,False,6.49,6.49
2713,1076,1,6 Pack Soft Drink,[Coke],$6.49,False,6.49,6.49
...,...,...,...,...,...,...,...,...
2384,948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75,False,8.75,8.75
781,322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",$8.75,False,8.75,8.75
2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",$8.49,False,8.49,8.49
1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25,True,11.25,11.25
1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",$8.49,False,8.49,8.49

In [45]:
#By default, sort_index() sorts in the column direction (vertical direction) according to the row name (label).

chipo.item_name.sort_index()

0                Chips and Fresh Tomato Salsa
1                                        Izze
2                            Nantucket Nectar
3       Chips and Tomatillo-Green Chili Salsa
4                                Chicken Bowl
                        ...
4617                            Steak Burrito
4618                            Steak Burrito
4619                       Chicken Salad Bowl
4620                       Chicken Salad Bowl
4621                       Chicken Salad Bowl
Name: item_name, Length: 4622, dtype: object

### Step 7. What was the quantity of the most expensive item ordered?

In [63]:
chipo.groupby('item_name')

chipo.sort_values(['quantity'], ascending=False).head(1)

#chipo.sort_values(by = "item_price", ascending = False).head(1)

,order_id,quantity,item_name,choice_description,item_price,items_10dollar,price_float,price_per_item
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25,True,44.25,2.95

In [75]:
chipo.quantity.max()

15

In [72]:
chipo.max()

order_id                       1834
quantity                         15
item_name         Veggie Soft Tacos
item_price                   $9.39
items_10dollar                 True
price_float                   44.25
price_per_item                11.89
dtype: object

In [73]:
# chipo.item_price.max()  #gives wrong o/p as item price not converted to int
chipo.price_float.max()

44.25

In [74]:
#Return index of first occurrence of maximum over requested axis.
chipo.price_float.idxmax()

3598

### Step 8. How many times was a Veggie Salad Bowl ordered?

In [81]:
chipo[chipo.item_name == 'Veggie Salad Bowl'].quantity.sum()

18

### Step 9. How many times did someone order more than one Canned Soda?

In [90]:
(chipo[chipo.item_name == 'Canned Soda'].quantity>1).sum()

20

In [99]:
#Get the number of rows: len(df)
df = (chipo[(chipo.item_name == "Canned Soda") & (chipo.quantity > 1)])
len(df)

20